[{"id": "0x93b57204df8a33567da01a935686121d69d1443ef2189da45cfb011efc17fcae", "analysis": "Title: CIP-63: Renewing the CoW Grants Program\nID: 0x93b57204df8a33567da01a935686121d69d1443ef2189da45cfb011efc17fcae\nStatus: Closed\nDeadline: January 31, 2025\n\nSummary:\nThe proposal aims to renew the CoW Grants Program for the period from February 1, 2025, to January 31, 2026. It requests an additional 383,000 xDAI from the Treasury to support the Grants DAO, bringing the total available funds to 600,000 xDAI and 1,465,260 COW for grant activities, with 4,990,000 COW allocated for volume grants. The program is designed to foster innovation and growth within the CoW ecosystem by funding impactful projects.\n\nKey Points:\n- The proposal requests an additional 383,000 xDAI to fully fund the Grants DAO for 2025.\n- The Grants DAO will have the authority to allocate part of the CoW Volume budget to non-volume CoW grants.\n- A discretionary bonus system is introduced for grantees who exceed expectations, with bonuses awarded by the committee without requiring a Snapshot vote.\n\nImpact on CoW Protocol:\nThe renewal of the Grants Program is expected to continue driving innovation and growth within the CoW ecosystem by supporting projects that align with its goals and contribute to its expansion.\n\nVoting Recommendation:\nFor - The proposal supports the continued growth and innovation within the CoW ecosystem, ensuring that impactful projects receive necessary funding.\n\nPriority Level: High\n```", "processed_at": 1739563792, "space": "cow.eth", "state": "closed"}, {"id": "0xdf9c7d3c8964de744c6bf99a89f60833e8904953bbe3e1c6856eb59939f82a2f", "analysis": "Title: CIP-62: Core Treasury team mandate and funding  \nID: 0xdf9c7d3c8964de744c6bf99a89f60833e8904953bbe3e1c6856eb59939f82a2f  \nStatus: Closed  \nDeadline: 1738770650  \n\nSummary:  \nThis proposal aims to consolidate the mandates of the Core Treasury team and request an allocation of 80 million COW tokens. The objective is to empower the team to pursue liquidity provisioning, economic opportunities, and funding for CoW DAO's product roadmap from 2025 to 2028. The proposal seeks to strategically allocate COW tokens with long-term partners to maximize funds for CoW DAO's products.\n\nKey Points:  \n- Request for 80 million COW tokens to support various initiatives including product development, defense reserves, and liquidity provision.  \n- Emphasis on increasing the buffer of funds in the treasury to scale up the core team.  \n- Flexibility in reallocating funds between categories to ensure optimal use of resources.\n\nImpact on CoW Protocol:  \nThe proposal is expected to enhance the financial stability and operational capacity of CoW Protocol, enabling it to continue its innovative contributions to the DeFi space.\n\nVoting Recommendation:  \nFor - The proposal supports strategic growth and financial stability, aligning with CoW DAO's long-term goals.\n\nPriority Level: High", "processed_at": 1739563798, "space": "cow.eth", "state": "closed"}, {"id": "0xbafee087f3a1d5757e44a72fa76e8624ce212623153816a936a8888741485ef5", "analysis": "Title: CIP-61: price-improvement-share, Revenue-share and Fees on CoW Protocol  \nID: 0xbafee087f3a1d5757e44a72fa76e8624ce212623153816a936a8888741485ef5  \nStatus: Closed  \nDeadline: January 29, 2025  \n\nSummary:  \nThis proposal aims to finalize the revenue model experimentation for CoW Protocol by continuing with price-improvement-sharing as the primary revenue model. It also introduces options for partners to apply fees on trades attributed to their user flow, alongside a revenue-sharing model for CoW DAO. The proposal allows CoW DAO to amend these models through future proposals.\n\nKey Points:  \n- Implementation of price-improvement-sharing as the primary revenue model, with options for new strategies.  \n- Introduction of partner fees and a revenue-sharing model for CoW DAO.  \n- Flexibility for CoW DAO to amend revenue models through new proposals.\n\nImpact on CoW Protocol:  \nThe proposal is expected to enhance CoW Protocol's financial self-sustainability by optimizing revenue generation through price-improvement-sharing and partner fees, aligning incentives between CoW DAO and its users.\n\nVoting Recommendation:  \nFor - The proposal supports CoW Protocol's financial sustainability and aligns with previous mandates, offering flexibility for future adjustments.\n\nPriority Level: High", "processed_at": 1739563803, "space": "cow.eth", "state": "closed"}, {"id": "0xb052ef3be633c2cb026f584e53856c81435d81378ba50fcda446cbb5832d5ac7", "analysis": "Title: CIP-60: Migrating The Gnosis Bonding Pool\nID: 0xb052ef3be633c2cb026f584e53856c81435d81378ba50fcda446cbb5832d5ac7\nStatus: Closed\nDeadline: 1735236882 (Unix timestamp)\n\nSummary:\nThe proposal aims to dissolve the existing Gnosis DAO bonding pool and migrate its operations to a new bonding pool. This move is intended to facilitate consistent address structures across all chains where CoW Protocol is deployed, enabling formal vouching transactions for solvers on all chains.\n\nKey Points:\n- The existing Gnosis bonding pool cannot be recreated on other chains due to its original creation method.\n- A new bonding pool has been established with a future-proof setup to support vouching across all chains.\n- The proposal requests the dissolution of the old bonding pool and the transfer of its funds to the owner.\n\nImpact on CoW Protocol:\nThe migration will ensure that CoW Protocol can implement vouching uniformly across all chains, enhancing the protocol's scalability and operational consistency.\n\nVoting Recommendation:\nFor - The migration is necessary for maintaining uniformity and scalability across multiple chains, which is crucial for the protocol's future operations.\n\nPriority Level: Medium\n```", "processed_at": 1739563808, "space": "cow.eth", "state": "closed"}, {"id": "0x511329756e1c208f45a5008f63fdede8309de4bac7a3072aa5ad7d852fa0041e", "analysis": "Title: CIP-59: Funding for Marketing & Business Development Services - Service Agreement  \nID: 0x511329756e1c208f45a5008f63fdede8309de4bac7a3072aa5ad7d852fa0041e  \nStatus: Closed  \nDeadline: December 25, 2024  \n\nSummary:  \nThis proposal requests the CoW DAO to allocate funds for securing comprehensive marketing and business development services from Defou S.A. for the year 2025. The aim is to enhance CoW DAO's brand visibility, customer engagement, and growth through strategic market analysis, brand positioning, and partnership development.\n\nKey Points:  \n- The Service Provider will conduct market analysis and develop brand positioning strategies to align with CoW DAO's values and objectives.  \n- Multi-channel marketing campaigns will be executed to increase visibility and attract high-quality partnerships.  \n- A budget of 20,000 USDC per month is proposed for the Service Provider, with additional service fees for third-party transactions capped at 5%.\n\nImpact on CoW Protocol:  \nThe proposal is expected to significantly boost CoW DAO's market presence and competitiveness in the decentralized finance ecosystem, fostering sustainable growth and innovation.\n\nVoting Recommendation:  \nFor - The proposal strategically aligns with CoW DAO's goals to expand its market reach and strengthen its brand through expert marketing and business development services.\n\nPriority Level: High", "processed_at": 1739563815, "space": "cow.eth", "state": "closed"}, {"id": "0x667887191e4f90a0c7a0716b73a54752c3848e643b99a7deb54affb860d722ac", "analysis": "Title: CIP-58: Funding for development services - Service Agreement No 4  \nID: 0x667887191e4f90a0c7a0716b73a54752c3848e643b99a7deb54affb860d722ac  \nStatus: Closed  \nDeadline: 2024-11-24  \n\nSummary:  \nThis proposal requests the allocation of $5,100,000 from the CoW DAO treasury to Nomev Labs, Lda for development services related to CoW Protocol and associated products for the year 2025. The funding will cover labor and expenses for enhancing and maintaining the CoW Products, ensuring competitive positioning in the decentralized exchange ecosystem.\n\nKey Points:  \n- The proposal outlines a comprehensive service agreement covering technical and non-technical support for CoW DAO products.  \n- It includes a detailed budget breakdown, highlighting team compensation, third-party services, and hosting costs.  \n- The proposal emphasizes the importance of continuous improvement and strategic pivots to maintain a competitive edge.\n\nImpact on CoW Protocol:  \nThe proposal aims to ensure the ongoing development and refinement of CoW Protocol and its products, which is crucial for maintaining competitiveness and enhancing user experience.\n\nVoting Recommendation:  \nFor - The proposal is well-structured and essential for the continued development and strategic growth of CoW Protocol, aligning with the DAO's vision and mission.\n\nPriority Level: High", "processed_at": 1739563821, "space": "cow.eth", "state": "closed"}, {"id": "0x46d4fea1492207cf400fcb7a01141a7d4c730791d658cc77236941fc9eb7dccb", "analysis": "Title: CIP-57: Solver rewards on all chains\nID: 0x46d4fea1492207cf400fcb7a01141a7d4c730791d658cc77236941fc9eb7dccb\nStatus: closed\nDeadline: 2024-11-17\n\nSummary:\nThe proposal aims to extend the successful solver rewards program from Ethereum mainnet to Gnosis Chain and Arbitrum One. By doing so, it seeks to enhance competition among solvers on these chains and incentivize new solvers to participate by offering rewards in the native currency of each chain.\n\nKey Points:\n- Extend the mainnet solver rewards program to Gnosis Chain and Arbitrum One.\n- Implement chain-dependent reward caps denominated in each chain's native currency.\n- Allow retroactive computation and payment of rewards from October 1, 2024.\n\nImpact on CoW Protocol:\nThis proposal is expected to strengthen the competitive landscape across all chains, potentially improving the quality of service and attracting specialized solvers to the protocol.\n\nVoting Recommendation:\nFor - The proposal builds on a proven mechanism from the mainnet and is likely to enhance solver participation and competition across multiple chains.\n\nPriority Level: Medium\n```", "processed_at": 1739563824, "space": "cow.eth", "state": "closed"}, {"id": "0xf923f716d6eb13564d810b9c6fc505d27c60c2fc8812460eaa6c3b6d75de0aee", "analysis": "Title: CIP-56: CoW DAO Snapshot settings updates\nID: 0xf923f716d6eb13564d810b9c6fc505d27c60c2fc8812460eaa6c3b6d75de0aee\nStatus: Closed\nDeadline: 2024-11-11\n\nSummary:\nThe proposal CIP-56 aims to update several settings within the CoW DAO Snapshot framework. It includes the introduction of a new version of the oSnap Snapshot plugin, a visual update to the CoW DAO logo, and adjustments to governance processes including the challenge period on oSnap.\n\nKey Points:\n- Introduction of version 3 of the oSnap Snapshot plugin with Tenderly simulation integration.\n- Update to the CoW DAO logo in the Snapshot space.\n- Adjustment of governance processes, including a three-day challenge period on oSnap and a reduction of the forum time to six days.\n\nImpact on CoW Protocol:\nThese updates are expected to enhance the verification process of transactions and improve the governance framework, ensuring more robust and efficient decision-making within the CoW Protocol.\n\nVoting Recommendation:\nFor - The proposal brings necessary updates and improvements that align with the goals of enhancing governance and operational efficiency within the CoW Protocol.\n\nPriority Level: Medium\n```", "processed_at": 1739563828, "space": "cow.eth", "state": "closed"}, {"id": "0xace71f6d52247f26fc776734fa735d85ff44674eba9f2c25af217c43c390c582", "analysis": "Title: CIP-55: Slashing of the GlueX Protocol solver and the CoW DAO bonding pool\nID: 0xace71f6d52247f26fc776734fa735d85ff44674eba9f2c25af217c43c390c582\nStatus: Closed\nDeadline: November 23, 2024\n\nSummary:\nThis proposal suggests slashing the CoW DAO bonding pool, which vouched for the GlueX solver, following an incident that resulted in a financial loss of $76,783 due to a vulnerability in the GlueX solver's deployment. The proposal aims to transfer funds from the CoW DAO bonding pool to CoW DAO's withdraw Safe as a procedural step, given that GlueX has already reimbursed the bonding pool.\n\nKey Points:\n- The incident was caused by a vulnerability in the GlueX solver's deployment, leading to unauthorized fund withdrawals.\n- GlueX promptly reimbursed the bonding pool and was later allow-listed after addressing the issue.\n- The proposal includes future process improvements to streamline bonding pool operations and enhance transparency.\n\nImpact on CoW Protocol:\nThe proposal reinforces the importance of solver accountability and highlights the need for improved processes to mitigate similar risks in the future.\n\nVoting Recommendation:\nFor - The proposal ensures financial accountability and introduces measures to prevent future vulnerabilities, aligning with CoW Protocol's best interests.\n\nPriority Level: Medium\n```", "processed_at": 1739563834, "space": "cow.eth", "state": "closed"}, {"id": "0x2638ee59df1f402421fe69abe76cd0154ec32d8b4ad88a136318c6c8c76b210d", "analysis": "Title: CIP-54: Dissolve Project Blanc bonding pool\nID: 0x2638ee59df1f402421fe69abe76cd0154ec32d8b4ad88a136318c6c8c76b210d\nStatus: Closed\nDeadline: 2024-11-15\n\nSummary:\nThe proposal aims to dissolve the Project Blanc bonding pool due to restructuring needs. It involves unwinding the current solver and bond, with plans to resubmit a bond later. The proposal includes returning funds to the original contributors.\n\nKey Points:\n- Project Blanc is undergoing restructuring, necessitating the dissolution of the bonding pool.\n- The proposal includes transferring 500,000 USDC and 1.5 million COW back to the original funding addresses.\n- A simulation of the proposed transactions is available for review.\n\nImpact on CoW Protocol:\nThe dissolution of the bonding pool is a temporary administrative measure and should not have a long-term impact on the CoW Protocol, as the bond will be resubmitted later.\n\nVoting Recommendation:\nFor - The proposal is a necessary administrative step to facilitate Project Blanc's restructuring, ensuring funds are returned to contributors.\n\nPriority Level: Medium\n```", "processed_at": 1739563838, "space": "cow.eth", "state": "closed"}]